# *4th Class:*

In [1]:
import pandas as pd

In [2]:
o = pd.Series([4,3,2,1])
print(o)

0    4
1    3
2    2
3    1
dtype: int64

In [3]:
s = pd.Series([100,200,300,400])
print("Values: ",s.values)
print("Index: ",s.index)

Values:  [100 200 300 400]
Index:  RangeIndex(start=0, stop=4, step=1)

In [4]:
s = pd.Series([30,20,10,40,25,40,0],index = ['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday'])
print(s)

Monday       30
Tuesday      20
Wednesday    10
Thursday     40
Friday       25
Saturday     40
Sunday        0
dtype: int64

In [5]:
sdata  ={"Sindh":3500,"Punjab":4500,"KPK":3000,"Balochistan":4000}
tax_by_state = pd.Series(sdata, index = ["Punjab","Sindh","KPK","Balochistan","GB"])
print(tax_by_state)
print("==============================")
print(pd.isnull(tax_by_state))

Punjab         4500.0
Sindh          3500.0
KPK            3000.0
Balochistan    4000.0
GB                NaN
dtype: float64
==============================
Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

In [6]:
tax_by_state.isnull()

Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

In [7]:
sw = pd.Series([20, 30, 20, 25, 30, 40, 0], 
               index = ['mon', 'tue', 'wed', 'thr','fri', 'sat', 'sun'])
print(sw)
sw.index = ["m", "t", "w", "t", "f", "s", "s"]
print(sw)

mon    20
tue    30
wed    20
thr    25
fri    30
sat    40
sun     0
dtype: int64
m    20
t    30
w    20
t    25
f    30
s    40
s     0
dtype: int64

In [8]:
s = pd.Series([20,30,40,50,60,70,80],
             index = ["Mon","Tue","Wed","Thurs","Fri","Sat","Sun"])
print(s)
s.index = ["M","T","W","T","F","S","S"]
print("=================================")
print(s)

Mon      20
Tue      30
Wed      40
Thurs    50
Fri      60
Sat      70
Sun      80
dtype: int64
=================================
M    20
T    30
W    40
T    50
F    60
S    70
S    80
dtype: int64

In [9]:
import numpy as np
a = np.array([2,3,4,5,6,7])
b = np.array(["a","b","c","d","e",'f'])
c = pd.Series(a,index=b)
print(c)

a    2
b    3
c    4
d    5
e    6
f    7
dtype: int32

# *Class 5:*

## DataFrame:

In [11]:
apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

data = {"apples":apples,"oranges":oranges}
fruit_df = pd.DataFrame(data)
print(fruit_df)

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [25]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
year = [2000, 2001, 2002, 2001, 2002, 2003]
population = [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
data = {"state":state,"year":year,"population":population}
a = pd.DataFrame(data,index = ["1st","2nd","3rd","4th","5th","6th"])
print(a)

      state  year  population
1st    Ohio  2000         1.5
2nd    Ohio  2001         1.7
3rd    Ohio  2002         3.6
4th  Nevada  2001         2.4
5th  Nevada  2002         2.9
6th  Nevada  2003         3.2

In [41]:
frame2=pd.DataFrame(data, columns=["year","state","population","debt"],index = ["a","b","c","d","e","f"])
frame2.head()

   year   state population debt
a  2000    Ohio        NaN  NaN
b  2001    Ohio        NaN  NaN
c  2002    Ohio        NaN  NaN
d  2001  Nevada        NaN  NaN
e  2002  Nevada        NaN  NaN

In [42]:
a.state

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: state, dtype: object

In [37]:
a["state"]

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: state, dtype: object

In [43]:
frame2['debt'] = 20
frame2.head()

   year   state population  debt
a  2000    Ohio        NaN    20
b  2001    Ohio        NaN    20
c  2002    Ohio        NaN    20
d  2001  Nevada        NaN    20
e  2002  Nevada        NaN    20

In [40]:
import numpy as np
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
        index=['one', 'two', 'three', 'four','five', 'six'])

ln = len(frame2) # finding now of rows in dataframe
#print(frame2)
rng = np.arange(ln)
print(rng)
frame2['debt'] = rng
frame2

[0 1 2 3 4 5]

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [62]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
#print( obj3 )
# might create a new rows
#obj3 =obj3.reindex(range(9))
#print(obj3)
#obj3 =obj3.reindex(range(9), method='ffill' )
#print(obj3)
obj3 =obj3.reindex(range(2,11), method="ffill")
obj3

2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
dtype: object

In [68]:
states = pd.DataFrame(np.arange(9).reshape((3, 3)),
index=['a', 'b', 'c'], columns=['Ohio', 'Texas', 'California'])
print(states)
# for your own working, run following statement without ffill
states = states.reindex(['a', 'b', 'c', 'd'],method = 'ffill')
print(states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

In [75]:
# column name changing using reindex method
states = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['a', 'b', 'c'], columns=['Ohio', 'Texas', 'California'])
print(states)
states_name = ['Texas', 'Utah', 'California','Ohio']
# can we user ffill parameter in column reindex mode ?
states =states.reindex(columns=states_name)
print(states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
   Texas  Utah  California  Ohio
a      1   NaN           2     0
b      4   NaN           5     3
c      7   NaN           8     6

In [83]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")

# dataframe.drop method would return a new dataframe without 
# having deleted rows. so store its into to dataframe variable
# or use inplace=True while droping rows or column

#data_df.drop(['Colorado', 'Ohio'], inplace =True)
#print(data_df)

#You can drop values from the columns by passing axis=1 
#or axis='columns' :
#data_df = data_df.drop('two', axis=1)
data_df.drop('two', axis=1, inplace = True)
print(data_df)

# if i want to remove a row for example 'Colorado', 
# how can we do that

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15